app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 15:15:41 UTC +00:00], ["name", "J. Nathan Matias"], ["provider", "twitter"], ["uid", "52332354"], ["updated_at", Sun, 20 Jan 2013 15:15:41 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '52332354' LIMIT 1
UPDATE "users" SET "twitter_token" = '52332354-dJI1ExjiGkJj96sEbL1VueFWENJoAX8TU9lHODqB5', "twitter_secret" = 'WUDKLN7nzEdYMsgSSODrbzMibOnr3faNAcRMpYKbo8k', "updated_at" = '2013-01-20 16:26:18.535555' WHERE "users"."id" = 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
    if(user.twitter_token.nil? or user.twitter_secret.nil?)
      user.twitter_token = auth.credentials.token
      user.twitter_secret = auth.credentials.secret
      user.save!